Revit 2026 API

# ViewPlacementOnSheetStatus Enumeration

---

Indicates whether the View is placed on a Sheet.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ViewPlacementOnSheetStatus
```
```vb
Public Enumeration ViewPlacementOnSheetStatus
```
```cpp
public enum class ViewPlacementOnSheetStatus
```
```fsharp
type ViewPlacementOnSheetStatus
```

| Member name | Value | Description |
| --- | --- | --- |
| CompletelyPlaced | 3 | The View is completely placed on a Sheet. |
| NotApplicable | 0 | The View cannot be placed on Sheet. |
| NotPlaced | 1 | The View is not placed on a Sheet. |
| PartiallyPlaced | 2 | The View is partially placed on a Sheet. |

Some Views can be placed on one or more Sheets completely or partially. For example, a Schedule divided in segments, and only some of them are placed on Sheets.

#### Reference

Autodesk.Revit.DB Namespace